{"id":"2016-08-07-tieba-final-summer-competition-review","title":"2016年五子棋贴吧★拯救玛利亚杯★ 备战录与棋评","contents":"\n\n报名比赛后有两周的时间，说起来因为每天要上班，因此实际的准备时间加进来其实不长，而且谱看多了有时还会恶心干呕。然后前段时间听了九指老师的高级班，对，我是顺便来安利一下九指的高级班的！听了高级班，讲到布局准备的一些东西，这次比赛里也有意识地去分析对手和准备开局。虽然针对个人的准备，最后都用在了别的人身上。\n\n总结起来，本次比赛发现自己还有很多不足，比如对于大型局面控制能力较弱、用时仍有不妥当的地方，中盘战斗力还要提高。好的地方是，尽力地准备了开局的变化，以及风格上还是在朝我喜欢的精准和暴力的方向发展。\n\n## 自我分析与可开局面分析\n\n一直以来，定式是我较弱的一块，尤其是复杂局面。计算力方面大概平均10步，在综合实力中应该不会成为短板。风格方面，我有意识地朝激烈、极限的方向去培养，喜欢进攻的快感。那么布局上如何通过准备，平稳地度过开局进入中盘，便是这次比赛准备的主要目标。\n\n局面方面，我也把26个开局在二打下结论和主观操作难度过了一遍，大致把它们分为三类：必胜并且不能主动开的局面、可战局面、超复杂局面。比如说：\n\n* 下意识排除的开局：寒星、恒星、花月、浦月\n* **必胜且不能主动开的局面**：主要是过于简单的一二打，或者通过简单套外势就能杀的局面，比如金星一打、水月两打、云雨月一打（二打还是有可考点）、明星一打、溪峡月两打等；\n* **可战局面**：黑白小优/中优局面，或即便理论必胜，但主观上仍然比较复杂的局面，比如银月二三打、明星二三打、残月、山新、名岚、流星等；\n* **复杂局面**：疏星、瑞星、松月、斜月。这些局面我觉得我还控制不太好。\n\n总结起来，开局的策略是这样：\n\n* 如果是实战经验丰富、综合实力明显比我强很多的选手，那么开疏星瑞星等大型局面我几乎必死，也即是说，被开局时不能开直指，开斜指，进入斜月或明星等局面；如果是我开局，斜指则用斜月，直指的话使用金星或疏星\n* 如果水平相当棋手，被开局随机应变，稳妥即可；我开局时则直指可下松月、疏星、金星等局面，斜指则云月二打、明星、斜月、银月等战斗局面都可以考虑\n\n下面上棋评。\n\n## 第一局\n\n> （人机6）普通的士兵：零度以下\n\n普通士兵自知不敌，一掌拍向了自己罩门，经脉尽断而忙。零度以下0手胜。\n\n## 第二局\n\n> 对局双方：零度以下【黑】：ran小小爱o【白】，不交换，5A-34，黑胜  \n> 用时：零度以下 读秒0:58 ：ran小小爱o 03:25\n\n![](http://oa6tlgkic.bkt.clouddn.com/2.jpg)\n\n可以看到我开斜指的缘由。但事后觉得还是开一三打较好，这个定式执黑我没有变招的余地，感觉13、15的变招都容易死，没有勇气考。于是定式一口气摆到27，微妙之处是H12（39）这个点忘了盖。这个局面是我第一次下，因此其中各部要点我也不是很清楚。\n\n33、35的交换思路是利用上方的优势，借一些棋到下方来，各处攻击。因此如果36-37，37-36，黑棋上下联系依然存在。然而38防守时，忘记上方39要点，被黑棋抢占后即已无法防守。\n\n## 第三局\n\n> 对局双方：乱码经理【黑】：零度以下【白】，不交换，5A-7，白胜  \n> 用时：乱码经理 03:54 ：零度以下 读秒 01:00\n\n![](http://oa6tlgkic.bkt.clouddn.com/3.jpg)\n\n刚坐下乱码就说度爹好，我就猜一定是群里攻攻受受中的某只了～原来是热爱妹子啊。不得不说，小号真是多。热爱开局，流星，一看这开局我就想得，戳中我毫无准备的局面了，那就只能遵循赛前以稳为主的作战方针，慢慢下了。想到这，我想那就留那个挡活二的5吧，于是我就点了一下，然后这5就被拿走了…\n\n短暂的戏虐啊不戏谑过后，其实觉得还好，6活三交换的定式我还是知道一些。定式正常进行到白10，黑11变招。脱谱第一手，马上长考（请听高级班）。不过这是比赛的第二局，说实话我脑袋还有点懵，不知道思考些啥，大致构思的是12、14的手段，黑棋眠三必挡，否则变化太多，迟早是后患。本来构思是若13反挡，14也走实战14，但这样14恰好是败，请见下面第一图拆解。\n\n长考5~6分钟后，实战12、14预想的手段，14的活二往上往下都有制作禁手进行进攻的手段，全局白棋比较生动，还是挺满意的。此时我主要考虑的是15-22这样挡外围的手段，不过热爱落下15的速度还是挺快的，我一看这是要包饺子啊！下12、14时没有考虑这样的15，于是临场算。实战时看到16、18的手段，已算到19的唯一防，觉得很有前途，于是花了剩余时间验证了16、18手段。落下时已读秒。不过20活三之后后面的进攻就比较清楚了，每分钟1步已经足够。白胜。\n\n![](http://oa6tlgkic.bkt.clouddn.com/3-2.jpg) ![](http://oa6tlgkic.bkt.clouddn.com/3-1.jpg) ![](http://oa6tlgkic.bkt.clouddn.com/3-3.jpg)\n\n第二图是实战13反挡时正确杀法，白棋强撸即胜；第三图是实战15挡外围时的杀法。\n\n## 第四局\n\n> 对局双方：落霞齐飞孤鹜【黑】：零度以下【白】，零度开局，小土豆交换执黑，5A-6，白超时负  \n> 用时：落霞齐飞孤鹜 读秒01:00 ：零度以下 读秒 0:00超时\n\n哎呀，这局棋学到很多东西，对一个先手所能进行的进攻和控制有了更深的体会。同时，对于准备好的变化，真的还要在实战前拿去练练，看看实战起来这个局面究竟能不能走，一般棋手会怎么思考，要点在哪里，等等。\n\n我认识小土豆，他不认识我。根据贴吧发的一些棋来看，感觉谱量比较大，战斗经验也很多，擅长快棋，计算力不知道，但棋感应该很好。不过由于小土豆报名较晚，我没有对他进行准备。我还是认为拼瑞星疏星肯定是死了，既然大型局面拼不得，那就把之前准备的一个金星大招拿出来用用呗。然后刚好是我开局，小土豆给直指，布局就顺利进行了。\n\n![](http://oa6tlgkic.bkt.clouddn.com/4.jpg)\n\n实战走到10手之后，就是我在金星二打中搜刮出来的一套不是能很简单套外势杀的必胜。黑棋长考，在11手的选择上用了10+分钟，对于只有15分钟的比赛，真是感觉有魄力。11手正确应对，12继续预定的考，之所以选择这个局面，是因为黑棋虽然必胜，但经过事先拆解，右边局部黑棋的必胜点是唯一的，其他看似强劲的进攻要么速败，要么导致局面不能必胜。本来以为只剩几分钟13肯定走不出正解的了，不过实战的13我没有考虑过。此时小土豆即将进入读秒了，不过我并没有松懈，因为13刚好脱了我的谱，况且土豆快棋也很强，说明真正的战斗现在才开始。\n\n14的选择上我并没有进行太长思考，15、16也如预料，一是因为这个16我也拆过，右上无杀，并且既然对手已经读秒，此时战术应是快速应对，给予对手时间压力，同时一边寻找黑棋破绽。\n\n然而17落下我就擦了一声，很显然我之前并没有考虑到17这样控制的手段。冷静了一下，快速分析了一下局面。白没有必败，因为黑是走脱了必胜的，但毕竟是黑优局，黑看起来是联系全局进行控制的节奏，白必须小心防。一下就感觉前期的优势不存在了好么，然后18开始就是白棋的防守，黑棋也是本着全局联系的思路，凭选点的感觉做棋。白防守时既不能让黑直接出vct，也不能让黑太简单飘到其他局部，基本我下完防守就知道黑棋要往哪儿飘了，真是心碎…19虽然符合常理，但在我思维之外，做棋好手。\n\n38寻求激烈的手段复杂化局面，41后黑棋下方已是白棋一手棋即可防住。白要在上方争取主动侵占空间后，先手回防下面，再寻找机会。一切都是那么刺激，然而此时我超时了。\n\n![](http://oa6tlgkic.bkt.clouddn.com/nick-young-mengbi.png)\n\n金星二打准备的这个考是这样的，如下图。13是局部唯一能必胜的进攻，其他A~D的进攻看似强劲，其实都必败；15活三也是几乎唯一的进攻。\n\n![](http://oa6tlgkic.bkt.clouddn.com/4-1.jpg)\n\n细细想来，白棋防守还可斟酌，因为本局基本是被黑棋轻松控制的节奏。另外，要对考的局面有更深的理解，因为既然是考黑优局，就要面对黑棋各种各样的进攻手段，它们虽然客观上不必胜，但主观上若理解不深，很可能就是自己中招了。\n\n不过，最大的问题似乎还是考黑优局这件事本身。之前因为定式接触少，一直对一些传闻中黑优/黑好控制的局面没有认识，认为可战，但经此一战，对黑棋一个先手的力量算是有了感觉。如果实战黑棋非常容易控制，或者有非常强烈的骗，那么将非常考验白棋的耐心与实力。因此，黑平衡局的学习似乎对我而言变得重要。总结起来，开局算是成功，中盘细节处理有待提高。\n\n## 第五局\n\n> 对局双方：零度以下【黑】：残花灬赤瞳【白】，不交换，5A-3下，白胜  \n> 用时：零度以下 00:37 ：残花灬赤瞳 02:17\n\n和小土豆的一局后，我觉得我还是得准备下平衡局，于是回来还是做了一些疏星的功课的，几个打点的前面10步不求甚解地看了遍。残花上一局的疏星也是用了这个6，我依然给这个5的打点，一是因为我做了一些准备，并认为残花有可能会选择自己熟悉的这个5进行战斗；二是根据我的准备，我认为是黑好走，并且没料到对手这么强。说白了，可能还是有点轻敌，不然还是不应该轻率地又给这个5。\n\n![](http://oa6tlgkic.bkt.clouddn.com/5.jpg)\n\n实战至15，完全在我的掌握之中，赛前主要准备的就是这个定式。棋情谱上就到这个15，此时我认为我的开局策略是成功的，度过了定式阶段，黑开始做棋。我还以为是黑优了呢，没想到是这样的结局！\n\n16，黑有左挡和实战两种手段。左挡在我看到下图的路线后，否定了，认为17后18跳三，然后就没有然后了。但实战20非常积极且强烈的手段！这个棋确实在我考虑之外，然而此时还没有死，另一个错就是此时的21我应该长考。而实战简单排除了一些线路（而非细算）之后就选定了21的防守。心浮气躁了。后面白理论必胜无误，实战自然但漂亮的追杀。\n\n第一次拼疏星就惨挂。这局棋，出现了我意料之外的20这样的手段，白优势局面下没有处理好，我服，学到了东西。不过，21自己没有长考选择好防守，也是心态还不够踏实的表现。同时，平衡局看来真是需要深入学习，并非背背谱就可以。也许其他事情也是这样的，一个事情要做到极致，必然需要积累和沉淀。精神应该在学习本身，体会当下学习的乐趣，而非执着于学到了多少、是否已经变强了这样的“结果”，心应该更沉静。这是需要时刻提醒自己的。\n\n![](http://oa6tlgkic.bkt.clouddn.com/5-1.jpg)\n\n如上图，17防活二外侧，18以下的进攻其实并不成立，25-A即可。\n\n## 第六局\n\n> 对局双方：聆视仙诉【黑】：零度以下【白】，不交换，5A-6左，白胜  \n> 用时：聆视仙诉 08:31 ：零度以下 读秒01:00\n\n![](http://oa6tlgkic.bkt.clouddn.com/6.jpg)\n\n看了一下仙诉前几轮的对局，感觉云月准备的有一路变化可以使用。不过黑7直接脱了我谱，而且和他对阵上一轮对手的7是同一个。白棋小心应对，毕竟是黑优局。28、30的进攻我觊觎已久，不过有几个防守找不出局部杀，所以22~26一直在上面积攒些材料。32果断转身，也是没办法中的办法，因为此时我又快读秒了，上面的杀法尽管没有地毯，但也只好一试。37直接防守就被简单抓三三了。\n\n本次云月准备的局面是下面两个。左图考点一是在15，二是在21，这一路是黑棋必须非常精细敢走才能杀出，本来是想着对于喜欢套外围而疏计算的棋手能用上；右图则是存在21这样的后中先妙手。\n\n![](http://oa6tlgkic.bkt.clouddn.com/6-1.jpg) ![](http://oa6tlgkic.bkt.clouddn.com/6-2.jpg)\n\n## 第七局\n\n> 对局双方：欲语泪流kun【黑】：零度以下【白】，不交换，5A-2右，白掉线日了汪怨念脸，和棋\n\n![](http://oa6tlgkic.bkt.clouddn.com/7.jpg)\n\n12开始已经有vct，我是有想过，还算不清。14局后拆解，接近必胜，进攻还是挺爽的，然而爽到一半突然断线。就不说啥了。对家最后还是说和棋，没有直接算负，还是很感谢。\n\n棋评结束，没有总结。谢谢阅读 :)\n"}